[
  {
      "title": "Inventory Management System",
      "imageSrc": "projects/inventory.png",
      "description": "This web site is my biggest project to date, showcasing my skills in full-stack development. Using laravel with react started kit, I was able to create a robust and scalable application, with roles, middleware, and a well-structured database that allows you to manage inventory efficiently.",
      "skills": ["Typescript: React", "PHP: Laravel"],
      "demo": "",
      "source": ""
    },
    {
      "title": "Los Revolucionarios",
      "imageSrc": "projects/revo.png",
      "description": "Website developed for a restaurant based on the owner's requirements to provide customers with information about their services. Additionally, administrative functions were included to allow the owner to modify the content as needed. ",
      "skills": ["JavaScript: React", "Python: Django", "CSS"],
      "demo": "https://revolucionarios2.vercel.app/",
      "source": "https://github.com/M0ORI/los_revolucionarios"
    },
    {
      "title": "Pokemon API",
      "imageSrc": "projects/poke.png",
      "description": "I developed a web page that integrates the Pokémon API to display various Pokémon data, such as their names, types, and stats. The website allows users to search for specific Pokémon and view detailed information retrieved from the API in real-time, offering an interactive experience.",
      "skills": ["JavaScript: React"],
      "demo": "https://poke-api-full.vercel.app/",
      "source": "https://github.com/Gerts18/PokeApi"
    },
    {
      "title": "Alura Geek",
      "imageSrc": "projects/AluraGeek.png",
      "description": "This web application enables you to manage products efficiently. It allows you to create and delete products, ensuring your product list is always current. Additionally, the app includes features like form validations and custom messages to enhance user experience and data integrity.",
      "skills": ["JavaScript", "HTML", "CSS"],
      "demo": "https://alura-geek-five-psi.vercel.app/",
      "source": "https://github.com/Gerts18/AluraGeek"
    },
    {
      "title": "SIM - CLE",
      "imageSrc": "projects/cle.png",
      "description": "Built a scalable institutional website with dynamic Livewire components for real-time validation, delivering features across sprints in collaboration with cross-functional teams while adhering to Git best practices.",
      "skills": ["PHP: Laravel"],
      "demo": "https://sim-cle.morelia.tecnm.mx/login",
      "source": ""
    },
    {
      "title": "Ficmac - Health Page",
      "imageSrc": "projects/ficmac.png",
      "description": "To learn Nextjs I build a web site along site a team of companions. With this project, I gained valuable experience in web applications using modern frameworks, working in a collaborative environment.",
      "skills": ["Typescript: Nextjs"],
      "demo": "https://ficmac-health-page-v2.onrender.com/",
      "source": "https://github.com/Gerts18/health-page"
    },
    {
      "title": "Computer Vision Project",
      "imageSrc": "projects/PapayasDetection.png",
      "description": "I was part of a team work in a two-month project where the primary focus was on utilizing neural networks and computer vision methods, specifically in Python and the main subject was about detecting the maturity of fruits.",
      "skills": ["Python", "OpenCV", "Ultralytics"],
      "demo": "",
      "source": "https://github.com/Gerts18/Computer-Vision-Project"
    }
    
  ]